{
  "Life & Identity": [
    "How would you describe your childhood self?",
    "What have you learned about yourself this year?",
    "How do you see yourself differently from how others see you?",
    "What legacy would you like to leave behind?",
    "If you could relive one year of your life, which would it be, and why?",
    "What do you value most about your cultural background?",
    "When do you feel most like yourself?",
    "If you were a book title, what would it be?",
    "What’s a habit or belief you've had since childhood that you still hold?",
    "What three words would you like to define you?"
  ],
  "Career & Passions": [
    "How did you discover your current passion?",
    "What role has mentorship played in your career?",
    "What’s a dream project you haven’t started yet?",
    "How has failure shaped your success?",
    "What would you do if money weren’t an issue?",
    "If you could teach anyone one skill, what would it be?",
    "How has your career shaped who you are as a person?",
    "What advice would you give to your younger self about work?",
    "What was the most challenging job you've ever had?",
    "What would you like to do in retirement?"
  ],
  "Love & Relationships": [
    "Who in your life has impacted you the most?",
    "How do you express love to those close to you?",
    "What was one of the happiest moments you’ve shared with a loved one?",
    "How has your idea of love changed over time?",
    "What qualities do you admire most in a friend?",
    "How do you approach forgiveness?",
    "What is the best compliment you’ve ever received?",
    "What’s a lesson a relationship has taught you?",
    "What’s the best advice about relationships you've ever received?",
    "How has your family shaped your views on relationships?"
  ],
  "Aspirations & Goals": [
    "What goal have you had for a long time but not yet pursued?",
    "What does success look like to you?",
    "What do you want to accomplish in the next five years?",
    "If you could master any new skill, what would it be?",
    "How do you set goals for yourself?",
    "What’s one risk you wish you had taken?",
    "What motivates you to keep moving forward?",
    "Who is someone whose life path you admire?",
    "How do you define personal fulfillment?",
    "What’s your biggest dream, and what steps are you taking toward it?"
  ],
  "Wisdom & Philosophy": [
    "What is one principle you try to live by?",
    "What’s something you’ve come to understand as you’ve grown older?",
    "How do you find meaning in difficult times?",
    "What advice would you give to someone younger?",
    "What do you think happens after we die?",
    "What’s your personal definition of happiness?",
    "What role does spirituality play in your life?",
    "How do you navigate ethical dilemmas?",
    "What’s a question you think everyone should ask themselves?",
    "What is a life lesson you wish you had learned earlier?"
  ],
  "Society & Worldview": [
    "How do you think the world will change in the next 50 years?",
    "What social issues are most important to you?",
    "What country or culture do you admire and why?",
    "What is something you think society undervalues?",
    "How would you make the world a better place?",
    "What does “freedom” mean to you?",
    "Who is a historical figure you admire, and why?",
    "How has travel shaped your perspective on life?",
    "What makes you hopeful for the future?",
    "What does community mean to you?"
  ],
  "Creativity & Imagination": [
    "What’s the most creative thing you’ve ever done?",
    "How do you like to express yourself creatively?",
    "What would you create if you could make anything in the world?",
    "Who or what inspires your creativity?",
    "What is a song or piece of art that resonates with you?",
    "How do you approach problem-solving creatively?",
    "What’s your ideal way to spend a weekend?",
    "How do you handle creative blocks?",
    "If you could direct a film, what story would you tell?",
    "What’s one creative project you would love to start?"
  ],
  "Personal Challenges & Growth": [
    "What is one of the hardest things you’ve overcome?",
    "How do you handle disappointment?",
    "What do you do when you feel stuck?",
    "What’s a mistake you learned the most from?",
    "What’s a difficult conversation you’ve had that was worthwhile?",
    "How do you manage stress?",
    "What’s a fear you’ve managed to conquer?",
    "How do you approach making big decisions?",
    "How do you bounce back from setbacks?",
    "What’s something you’re working to improve about yourself?"
  ],
  "Curiosities & Fun": [
    "What’s a skill you’ve always wanted to learn but haven’t?",
    "What’s a topic you could talk about for hours?",
    "What’s a place you’ve never visited but would like to?",
    "If you could spend a day with any fictional character, who would it be?",
    "What’s something quirky about you that people don’t usually know?",
    "If you could have any superpower, what would it be?",
    "What’s one thing on your bucket list?",
    "What’s the most interesting place you’ve ever been?",
    "What’s a book or movie that has changed your life?",
    "What’s a fun fact about yourself?"
  ],
  "Reflection & Gratitude": [
    "What’s a moment in your life you feel incredibly grateful for?",
    "Who has had a lasting impact on you?",
    "What is a daily ritual you’re thankful for?",
    "What’s one thing you couldn’t live without?",
    "What makes you feel at peace?",
    "How do you remind yourself to stay grounded?",
    "What’s a decision you’re proud of?",
    "What has been the greatest surprise of your life?",
    "Who do you feel most connected to, and why?",
    "How do you find joy in ordinary moments?"
  ]
}
